Friends | List of all members
ACAPI::MEP::v1::PipePreferenceTableContainer Class Referencefinal
MEP Element Manager
The PipePreferenceTableContainer can contain several PreferenceTableBase associated with piping. More...
#include <MEPPipePreferenceTableContainer.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PipePreferenceTableContainer:
 Friends
Result< PipePreferenceTableContainer >  | GetPipePreferenceTableContainer ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< UniqueID >  | AddNewTable (GS::UniString tableName)
Inserts a new preference table into the container.
Result< void >  | Delete (const UniqueID &uniqueId)
Deletes a preference table from the container.
 Protected Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl >)
Modifier (PreferenceTableContainerBase &)
Detailed Description
The PipePreferenceTableContainer can contain several PreferenceTableBase associated with piping.
Since
Archicad 27
The container is already initialized (but may be empty) and you can access it by calling GetPipePreferenceContainer.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Friends And Related Symbol Documentation
◆ GetPipePreferenceTableContainer
 Result< PipePreferenceTableContainer > GetPipePreferenceTableContainer  |  ( |   | )
friend
Returns
If able, returns the PipePreferenceTableContainer from the project.